brew "bat"
brew "dasel"
brew "direnv"
brew "fd"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "hunspell"
brew "modules"
brew "neovim"
brew "ripgrep"
brew "stow"
brew "tmux"
brew "tree"
brew "zellij"
brew "zoxide"
