tap "wader/tap"

brew "bitwise"
brew "cmake"
brew "coreutils" # GNU File, Shell, and Text utilities
brew "gdb"
brew "gnupg"
brew "grep"
brew "htop"
brew "imagemagick"
brew "pkg-config"
brew "ranger"
brew "shfmt"
brew "wader/tap/fq"

# tree-sitter
brew "tree-sitter"
brew "tree-sitter-cli"

# git
brew "git-filter-repo"

brew "lazygit"

# lua
brew "luarocks"

# python
brew "python"
brew "ruff"
brew "ty"
brew "uv"
brew "yapf"

# rust
brew "rust-analyzer"

# tools
brew "z3"
